; domain
(define (domain blocksworld-4ops)

(:requirements :typing)
(:types block) 

(:predicates (clear ?x - block)
             (on-table ?x - block)
             (arm-empty)
             (holding ?x - block)
             (on ?x ?y - block))

(:action pickup
  :parameters (?ob - block)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob - block)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob - block)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob - block)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem partial-goal-solvable)
  (:domain blocksworld-4ops)
  (:objects A B C D - block)
  (:init (arm-empty)
         (on-table A) (on-table B) (on-table C) (on-table D)
         (clear A) (clear B)
         (clear C) (clear D))
  (:goal (and (on A B) (on C D))))

; plan
1. (pickup a)
   deleted: (clear a) (on-table a) (arm-empty)
   added: (holding a)
   goals met: 0 of 2
2. (stack a b)
   deleted: (clear b) (holding a)
   added: (arm-empty) (clear a) (on a b)
   goals met: 1 of 2
3. (pickup c)
   deleted: (clear c) (on-table c) (arm-empty)
   added: (holding c)
   goals met: 1 of 2
4. (stack c d)
   deleted: (clear d) (holding c)
   added: (arm-empty) (clear c) (on c d)
   goals met: 2 of 2
